Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина; 
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	Движения.ВКМ_ДополнительныеНачисления.Очистить(); 	
	Движения.ВКМ_Удержания.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	МассивСотрудников = Новый Массив; 	
	
	Для Каждого СтрокаТЧ Из Начисления Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сотрудник       = СтрокаТЧ.Сотрудник;
		Движение.ВидРасчета      = СтрокаТЧ.ВидРасчета;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		
		Движение.ПериодДействияНачало = НачалоДня(СтрокаТЧ.ДатаНачала);
		Движение.ПериодДействияКонец  = КонецДня(СтрокаТЧ.ДатаОкончания);
		
		Если СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = ДобавитьМесяц(СтрокаТЧ.ДатаНачала, -12);
			Движение.БазовыйПериодКонец  = НачалоДня(СтрокаТЧ.ДатаНачала) - 1;
		КонецЕсли;
		
		Если МассивСотрудников.Найти(СтрокаТЧ.Сотрудник) = Неопределено Тогда
			МассивСотрудников.Добавить(СтрокаТЧ.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ДополнительныеНачисления Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сотрудник       = СтрокаТЧ.Сотрудник;
		Движение.ВидРасчета      = СтрокаТЧ.ВидРасчета;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		
		
		Если МассивСотрудников.Найти(СтрокаТЧ.Сотрудник) = Неопределено Тогда
			МассивСотрудников.Добавить(СтрокаТЧ.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	
	Для Каждого ТекСотрудник Из МассивСотрудников Цикл
		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.Сотрудник = ТекСотрудник;
		ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеНДФЛ.ПериодРегистрации = НачалоМесяца(Дата);
		ДвижениеНДФЛ.БазовыйПериодНачало = НачалоМесяца(Дата);
		ДвижениеНДФЛ.БазовыйПериодКонец = КонецМесяца(Дата);
	КонецЦикла;
	
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	Движения.ВКМ_Удержания.Записать(); 
	
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник");
	
	ЗапросОсн = Новый Запрос;
	ЗапросОсн.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРегистра.НомерСтроки КАК НомерСтроки,
		|	ДанныеРегистра.ВидРасчета КАК ВидРасчета,
		|	ЕСТЬNULL(ДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноДней,
		|	ЕСТЬNULL(ДанныеГрафика.ЗначениеПериодДействия, 0) КАК НормаДней,
		|	ЕСТЬNULL(ДанныеБазы.РезультатБаза, 0) КАК БазаДеньги,
		|	ЕСТЬNULL(ДанныеБазы.ОтработаноДнейБаза, 0) КАК БазаДни,
		|	ЕСТЬNULL(ТЧНачисления.РазмерОклад, 0) КАК РазмерОклад
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ДанныеГрафика
		|		ПО ДанныеРегистра.НомерСтроки = ДанныеГрафика.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК ДанныеБазы
		|		ПО ДанныеРегистра.НомерСтроки = ДанныеБазы.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ТЧНачисления
		|		ПО ДанныеРегистра.НомерСтроки = ТЧНачисления.НомерСтроки
		|			И (ТЧНачисления.Ссылка = &Ссылка)
		|ГДЕ
		|	ДанныеРегистра.Регистратор = &Ссылка";
	
	ЗапросОсн.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросОсн.УстановитьПараметр("Измерения", МассивИзмерений);
	
	ВыборкаОсн = ЗапросОсн.Выполнить().Выбрать();
	
	Пока ВыборкаОсн.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаОсн.НомерСтроки - 1];
		
		Если ВыборкаОсн.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Если ВыборкаОсн.НормаДней > 0 Тогда
				Движение.Результат = ВыборкаОсн.РазмерОклад / ВыборкаОсн.НормаДней * ВыборкаОсн.ОтработаноДней;
			КонецЕсли;
			Движение.ОтработаноДней = ВыборкаОсн.ОтработаноДней;
			
		ИначеЕсли ВыборкаОсн.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Если ВыборкаОсн.БазаДни > 0 Тогда
				Длительность = (Движение.ПериодДействияКонец - Движение.ПериодДействияНачало + 1) / 86400;
				Движение.Результат = (ВыборкаОсн.БазаДеньги / ВыборкаОсн.БазаДни) * Длительность;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать(); // Записываем результат Оклада и Отпуска
	
	ЗапросДоп = Новый Запрос;
	ЗапросДоп.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРегистра.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ОборотыРабот.СуммаКОплатеОборот, 0) КАК СуммаПроцента
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоМесяца, &КонецМесяца, , ) КАК ОборотыРабот
		|		ПО ДанныеРегистра.Сотрудник = ОборотыРабот.Сотрудник
		|ГДЕ
		|	ДанныеРегистра.Регистратор = &Ссылка";
		
	ЗапросДоп.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросДоп.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	ЗапросДоп.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	
	ВыборкаДоп = ЗапросДоп.Выполнить().Выбрать();
	Пока ВыборкаДоп.Следующий() Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления[ВыборкаДоп.НомерСтроки - 1];
		
		Движение.Результат = ВыборкаДоп.СуммаПроцента; 
	КонецЦикла;
	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	
	ЗапросНДФЛ = Новый Запрос;
	ЗапросНДФЛ.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРегистраУдержаний.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(БазаОсновные.РезультатБаза, 0) + ЕСТЬNULL(БазаДополнительные.РезультатБаза, 0) КАК БазаОбщая
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ДанныеРегистраУдержаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК БазаОсновные
		|		ПО ДанныеРегистраУдержаний.НомерСтроки = БазаОсновные.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК БазаДополнительные
		|		ПО ДанныеРегистраУдержаний.НомерСтроки = БазаДополнительные.НомерСтроки
		|ГДЕ
		|	ДанныеРегистраУдержаний.Регистратор = &Ссылка";
		
	ЗапросНДФЛ.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросНДФЛ.УстановитьПараметр("Измерения", МассивИзмерений);
	
	ВыборкаНДФЛ = ЗапросНДФЛ.Выполнить().Выбрать();
	
	Пока ВыборкаНДФЛ.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания[ВыборкаНДФЛ.НомерСтроки - 1];
		Если ВыборкаНДФЛ.БазаОбщая > 0 Тогда
			Движение.Результат = ВыборкаНДФЛ.БазаОбщая * 0.13;
		КонецЕсли;
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();   

	ЗапросВзаиморасчеты = Новый Запрос;
	ЗапросВзаиморасчеты.Текст = 
	    "ВЫБРАТЬ
	    |	ВКМ_Осн.Сотрудник КАК Сотрудник,
	    |	ВКМ_Осн.Результат КАК Сумма
	    |ИЗ
	    |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_Осн
	    |ГДЕ
	    |	ВКМ_Осн.Регистратор = &Ссылка
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ВКМ_Доп.Сотрудник,
	    |	ВКМ_Доп.Результат
	    |ИЗ
	    |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_Доп
	    |ГДЕ
	    |	ВКМ_Доп.Регистратор = &Ссылка
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ВКМ_Уд.Сотрудник,
	    |	-ВКМ_Уд.Результат
	    |ИЗ
	    |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Уд
	    |ГДЕ
	    |	ВКМ_Уд.Регистратор = &Ссылка";
	
	ЗапросВзаиморасчеты.УстановитьПараметр("Ссылка", Ссылка);
	
	
	ТаблицаВзаиморасчетов = ЗапросВзаиморасчеты.Выполнить().Выгрузить();
	ТаблицаВзаиморасчетов.Свернуть("Сотрудник", "Сумма");
	
	Для Каждого СтрокаТЗ Из ТаблицаВзаиморасчетов Цикл
		Если СтрокаТЗ.Сумма <> 0 Тогда
	    	Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
	    	Движение.Период = Дата;
	    	Движение.Сотрудник = СтрокаТЗ.Сотрудник;
	    	Движение.Сумма = СтрокаТЗ.Сумма;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры