Процедура ОбработкаПроведения(Отказ, Режим)
	
    Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
    Движения.ВКМ_Удержания.Записывать = Истина;

    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
    Для Каждого Стр Из СписокСотрудников Цикл
		
        Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.Сотрудник = Стр.Сотрудник;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
        Движение.ПериодРегистрации = НачалоМесяца(Дата); 
		Движение.Результат = Стр.СуммаПремии;
		
        ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
        ДвижениеНДФЛ.Сотрудник = Стр.Сотрудник;
        ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        
        ДвижениеНДФЛ.ПериодРегистрации = НачалоМесяца(Дата); 
        
        ДвижениеНДФЛ.Результат = Стр.СуммаПремии * 0.13;
        
        ДвижениеВз = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
        ДвижениеВз.Период = Дата;
        ДвижениеВз.Сотрудник = Стр.Сотрудник;
        ДвижениеВз.Сумма = Стр.СуммаПремии - ДвижениеНДФЛ.Результат;
		
    КонецЦикла;
	
КонецПроцедуры