Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	Движения.ВКМ_Удержания.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	
	МассивСотрудников = Новый Массив; 	
	Для Каждого СтрокаТЧ Из Начисления Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сотрудник       = СтрокаТЧ.Сотрудник;
		Движение.ВидРасчета      = СтрокаТЧ.ВидРасчета;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		
		Движение.ПериодДействияНачало = СтрокаТЧ.ДатаНачала;
		Движение.ПериодДействияКонец  = КонецДня(СтрокаТЧ.ДатаОкончания);
		
		Если СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = ДобавитьМесяц(СтрокаТЧ.ДатаНачала, -12);
			Движение.БазовыйПериодКонец  = НачалоДня(СтрокаТЧ.ДатаНачала) - 1;
		КонецЕсли;
		
		Если МассивСотрудников.Найти(СтрокаТЧ.Сотрудник) = Неопределено Тогда
			МассивСотрудников.Добавить(СтрокаТЧ.Сотрудник);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСотрудник Из МассивСотрудников Цикл
		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.Сотрудник = ТекСотрудник;
		ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеНДФЛ.ПериодРегистрации = НачалоМесяца(Дата);
		ДвижениеНДФЛ.БазовыйПериодНачало = НачалоМесяца(Дата);
		ДвижениеНДФЛ.БазовыйПериодКонец = КонецМесяца(Дата);
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать(); 
	
	
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРегистра.НомерСтроки КАК НомерСтроки,
		|	ДанныеРегистра.ВидРасчета КАК ВидРасчета,
		|	ЕСТЬNULL(ДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноДней,
		|	ЕСТЬNULL(ДанныеГрафика.ЗначениеПериодДействия, 0) КАК НормаДней,
		|	ЕСТЬNULL(ДанныеБазы.РезультатБаза, 0) КАК БазаДеньги,
		|	ЕСТЬNULL(ДанныеБазы.ОтработаноДнейБаза, 0) КАК БазаДни,
		|	ЕСТЬNULL(ТЧНачисления.РазмерОклад, 0) КАК РазмерОклад,
		|	ЕСТЬNULL(ОборотыРабот.СуммаКОплатеОборот, 0) КАК СуммаПроцента
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ДанныеГрафика
		|		ПО ДанныеРегистра.НомерСтроки = ДанныеГрафика.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК ДанныеБазы
		|		ПО ДанныеРегистра.НомерСтроки = ДанныеБазы.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ТЧНачисления
		|		ПО ДанныеРегистра.НомерСтроки = ТЧНачисления.НомерСтроки
		|			И (ТЧНачисления.Ссылка = &Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоМесяца, &КонецМесяца, , ) КАК ОборотыРабот
		|		ПО ДанныеРегистра.Сотрудник = ОборотыРабот.Сотрудник
		|ГДЕ
		|	ДанныеРегистра.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Измерения", МассивИзмерений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Если Выборка.НормаДней > 0 Тогда
				Движение.Результат = Выборка.РазмерОклад / Выборка.НормаДней * Выборка.ОтработаноДней;
			КонецЕсли;
			Движение.ОтработаноДней = Выборка.ОтработаноДней;
			
		ИначеЕсли Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Процент Тогда
			Движение.Результат = (Выборка.СуммаПроцента * Выборка.РазмерОклад) / 100;
			
		ИначеЕсли Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Если Выборка.БазаДни > 0 Тогда
				Длительность = (Движение.ПериодДействияКонец - Движение.ПериодДействияНачало + 1) / 86400;
				Движение.Результат = (Выборка.БазаДеньги / Выборка.БазаДни) * Длительность;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	ЗапросНДФЛ = Новый Запрос;
	ЗапросНДФЛ.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРегистраУдержаний.НомерСтроки КАК НомерСтроки,
		|	ДанныеРегистраУдержаний.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(БазаОсновные.РезультатБаза, 0) КАК БазаОсновные
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ДанныеРегистраУдержаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК БазаОсновные
		|		ПО ДанныеРегистраУдержаний.НомерСтроки = БазаОсновные.НомерСтроки
		|ГДЕ
		|	ДанныеРегистраУдержаний.Регистратор = &Ссылка";
		
	ЗапросНДФЛ.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросНДФЛ.УстановитьПараметр("Измерения", МассивИзмерений);
	
	ВыборкаНДФЛ = ЗапросНДФЛ.Выполнить().Выбрать();
	
	Пока ВыборкаНДФЛ.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания[ВыборкаНДФЛ.НомерСтроки - 1];
		Если ВыборкаНДФЛ.БазаОсновные > 0 Тогда
			Движение.Результат = ВыборкаНДФЛ.БазаОсновные * 0.13;
		КонецЕсли;
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();   
	
	
	ЗапросВзаиморасчеты = Новый Запрос;
	ЗапросВзаиморасчеты.Текст = 
	    "ВЫБРАТЬ
	    |	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	    |	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК Сумма
	    |ПОМЕСТИТЬ ВТ_Итоги
	    |ИЗ
	    |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	    |ГДЕ
	    |	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ВКМ_ОсновныеНачисления.Сотрудник
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ВТ_Итоги.Сотрудник КАК Сотрудник,
	    |	ВТ_Итоги.Сумма - ЕСТЬNULL(СУММА(ВКМ_Удержания.Результат), 0) КАК ИтоговаяСумма
	    |ИЗ
	    |	ВТ_Итоги КАК ВТ_Итоги
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	    |		ПО ВТ_Итоги.Сотрудник = ВКМ_Удержания.Сотрудник
	    |			И (ВКМ_Удержания.Регистратор = &Ссылка)
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ВТ_Итоги.Сотрудник,
	    |	ВТ_Итоги.Сумма";
	
	ЗапросВзаиморасчеты.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаИтог = ЗапросВзаиморасчеты.Выполнить().Выбрать();
	
	Пока ВыборкаИтог.Следующий() Цикл
	    Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
	    Движение.Период = Дата;
	    Движение.Сотрудник = ВыборкаИтог.Сотрудник;
	    Движение.Сумма = ВыборкаИтог.ИтоговаяСумма;
	КонецЦикла;
	
КонецПроцедуры