// Гумерова ГР 10.02.2026 - Управление видимостью реквизитов

&НаСервере
Процедура ВКМ_УправлениеВидимостьюНаСервере()
	
	ЭтоАбонентскоеОбслуживание = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание); 
	
	Элементы.ВКМ_ДатаНачалаДоговора.Видимость = ЭтоАбонентскоеОбслуживание;
    Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = ЭтоАбонентскоеОбслуживание;   
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ЭтоАбонентскоеОбслуживание;  
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭтоАбонентскоеОбслуживание;       
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_УправлениеВидимостьюНаКлиенте()
	ВКМ_УправлениеВидимостьюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_УправлениеВидимостьюНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ВКМ_УправлениеВидимостьюНаСервере();
КонецПроцедуры

//    Гумерова ГР 10.02.2026 - окончание