&НаКлиенте
Процедура Заполнить(Команда) 
	
	ЗаполнитьНаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	// Очищаем таблицу перед заполнением
	Объект.СписокДоговоров.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Договор,
		|	ЕСТЬNULL(Реализации.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
		|		ПО (Реализации.Договор = Договоры.Ссылка)
		|			И (НАЧАЛОПЕРИОДА(Реализации.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ))
		|			И (НЕ Реализации.ПометкаУдаления)
		|ГДЕ
		|	Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И НЕ Договоры.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Период", Объект.Период);
	
		Объект.СписокДоговоров.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СписокДоговоров.Добавить();
		НоваяСтрока.ТЧ_Договор = Выборка.Договор;
		НоваяСтрока.ТЧ_Реализация = Выборка.Реализация;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если Объект.СписокДоговоров.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Список договоров пуст!");
		Возврат;
	КонецЕсли;
	
	// Подготовка параметров для передачи в фоновое задание
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Период", Объект.Период);
	
	МассивДоговоров = Новый Массив;
	Для Каждого Стр Из Объект.СписокДоговоров Цикл
		Если Стр.ТЧ_Реализация.Пустая() Тогда
			МассивДоговоров.Добавить(Стр.ТЧ_Договор);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗадания.Вставить("МассивДоговоров", МассивДоговоров);
	
	Если МассивДоговоров.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Все документы уже созданы.");
		Возврат;
	КонецЕсли;

	// 1. Идем на сервер и запускаем задание. Сервер вернет нам структуру с результатом запуска.
	РезультатФонового = ЗапуститьФоновоеЗаданиеНаСервере(ПараметрыЗадания);
	
	// 2. Обрабатываем статус запуска НА КЛИЕНТЕ
	Если РезультатФонового.Статус = "Выполняется" Тогда
		
		// БСП сама будет показывать окно загрузки и крутилку
		Оповещение = Новый ОписаниеОповещения("ПослеЗавершенияЗадания", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = "Идет создание документов...";
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФонового, Оповещение, ПараметрыОжидания);
		
	ИначеЕсли РезультатФонового.Статус = "Выполнено" Тогда
		// Если выполнилось моментально (синхронно)
		ПоказатьПользователюСообщение("Создание документов завершено!");
		ЗаполнитьНаСервере(); // Обновляем список на форме
		
	ИначеЕсли РезультатФонового.Статус = "Ошибка" Тогда
		// Если произошла ошибка прямо в момент запуска
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатФонового.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере  
Функция ЗапуститьФоновоеЗаданиеНаСервере(ПараметрыЗадания)
	
	// Настраиваем БСП
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Создание актов абонентского обслуживания";
	
	// Указываем путь к процедуре, которая будет создавать документы в модуле менеджера обработки
	ИмяМетода = "Обработки.ВКМ_МассовоеСозданиеАктов.ВыполнитьСоздание"; 
	
	// Запуск длительной операции БСП и возврат структуры с результатом на клиент
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыЗадания, ПараметрыВыполнения);
	
КонецФункции


&НаКлиенте
Процедура ПослеЗавершенияЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ПоказатьПользователюСообщение("Отменено пользователем.");
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ПоказатьПользователюСообщение("Создание документов завершено!");
		Заполнить(Неопределено); // Сразу после завершения автоматически обновляем список на форме
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Сообщить("Ошибка: " + Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПользователюСообщение(Текст)
	ПоказатьОповещениеПользователя("Массовое создание", , Текст);
КонецПроцедуры