
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресХранилища = Параметры.АдресДанных;
	Если АдресХранилища = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТЧ = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	СерияОтпуск = Диаграмма.УстановитьСерию("Отпуска сотрудников");
	
	Для Каждого Стр Из ДанныеТЧ Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Сотрудник) ИЛИ Не ЗначениеЗаполнено(Стр.ДатаНачала) Тогда 
			Продолжить; 
		КонецЕсли;
		
		ТочкаСотрудник = Диаграмма.УстановитьТочку(Стр.Сотрудник);
		ТочкаСотрудник.Текст = Строка(Стр.Сотрудник);
		
		Значение = Диаграмма.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец  = КонецДня(Стр.ДатаОкончания);
		
		Интервал.Текст = Формат(Стр.ДатаНачала, "ДФ=dd.MM") + " - " + Формат(Стр.ДатаОкончания, "ДФ=dd.MM");
		
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;	
КонецПроцедуры
