&НаСервере
Процедура ПроверитьЛимитОтпусковНаСервере()
	
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить();
	ТЗ.Колонки.Добавить("ДнейОтпуска", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	
	Для Каждого Стр Из ТЗ Цикл
		Если ЗначениеЗаполнено(Стр.ДатаНачала) И ЗначениеЗаполнено(Стр.ДатаОкончания) Тогда
			
			Стр.ДнейОтпуска = (КонецДня(Стр.ДатаОкончания) - НачалоДня(Стр.ДатаНачала) + 1) / 86400;
		КонецЕсли;
	КонецЦикла;
		
	ТЗ.Свернуть("Сотрудник", "ДнейОтпуска");
	
	Для Каждого СтрокаТЧ Из Объект.ОтпускаСотрудников Цикл
		СтрокаИтогов = ТЗ.Найти(СтрокаТЧ.Сотрудник, "Сотрудник");
		Если СтрокаИтогов <> Неопределено И СтрокаИтогов.ДнейОтпуска > 28 Тогда
			СтрокаТЧ.ПревышениеЛимита = Истина;
		Иначе
			СтрокаТЧ.ПревышениеЛимита = Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ПроверитьЛимитОтпусковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПроверитьЛимитОтпусковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ПроверитьЛимитОтпусковНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)  
	
	АдресХранилища = ПодготовитьДанныеНаСервере();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресХранилища);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ВКМ_АнализГрафика", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры       

&НаСервере
Функция ПодготовитьДанныеНаСервере()
	
	ДанныеДляПередачи = Объект.ОтпускаСотрудников.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляПередачи, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции
